<template>
	<div class="wrapper">
		<div class="container">
			<div class="container_title">
				<h1>Территория Внукова</h1>
				<hr />
				<p>Интерактивная площадка, основанная на книгах писателя.</p>
			</div>
		</div>
		<div class="text">
			<h2>ВЫСТАВКА «ЗНАКОМЬТЕСЬ: НИКОЛАЙ АНДРЕЕВИЧ ВНУКОВ»</h2>
			<p>Выставка состоит из 8 стендов, размещенных в зале для мероприятий и интерактивной инсталляции «Рабочий
				стол Николая Внукова», где размещена его печатная машинка, на которой желающие могут печатать фрагменты
				его произведений – они также находятся на столе или рядом на стеллаже или полке. Документы Внукова (если
				они есть в библиотеке) используются как иллюстративный материал для стендов.</p>
			<p>Возле каждого стенда может быть небольшая полка с книгами, упомянутыми в данном стенде. Если такой
				возможности нет, то можно поставить все книги на один стеллаж.</p>

			<h2>ПУТЕШЕСТВИЕ НАЧИНАЕТСЯ</h2>
			<p>Чтобы путешествовать по временам и странам, вовсе не обязательно покупать билеты или изобретать машину
				времени. Достаточно просто открыть книгу – например, любую из книг Николая Внукова.</p>
			<p>«Папа отворил дверцы шкафа. На полках тесными рядами стояли книги. Папа легонько толкнул стену из книг
				влево. Стена скользнула вбок и исчезла. Шкаф был пуст, будто в нём не стояло никогда ни одной книги! Он
				стал похож на кабинку лифта. Так же, как в лифте, под потолком слабо светила электрическая лампочка…</p>
			<p>У многих людей есть такие машины, многие путешествуют. Ты не представляешь, как это интересно! В эту
				машину вложено много воспоминаний, много работы, много книг. И её заправляют не бензином, а мечтой. Её
				строили люди всех стран мира — путешественники, писатели, учёные»</p>
			<p>Так в повести «Путешествие не кончается» девятилетний Андрей открывает для себя смысл чтения.
				Оказывается, с помощью книг можно побывать в таких местах, где вряд ли когда-нибудь ты окажешься. Узнать
				о людях, которых ты никогда не встретишь, но которые живут рядом с тобой. Книги помогают нам понять мир,
				в котором мы живем – и сделать его лучше.</p>

			<h2>ВОЙНА И МОЛОДОСТЬ</h2>
			<p>Многие книги Николая Внукова посвящены Великой Отечественной войне. Ему было всего 16 лет, когда началась
				война – и уже через год он принял свой первый бой. В танковом сражении в горах Северной Осетии из 260
				человек осталось в живых всего 39. К счастью, среди них был и семнадцатилетний Коля Внуков.</p>
			<p>Он служил радистом до 1946 года, был контужен и дважды ранен, дошёл до австрийской Вены и китайского
				Мукдэна, награжден медалями и орденами. «Никаких особенных подвигов во время войны не совершал, просто
				работал, как работали все на фронте», - писал о себе Внуков.</p>
			<p>Этой «работе» посвящены многие его повести и рассказы: «Наша восемнадцатая осень», «Приказ по шестому
				полку, «На чужих крыльях», «Старая гильза», «Шрамы на колоннах», «Москва за нами».</p>

			<h2>ТРИ ПРОФЕССИИ</h2>
			<p>Первая профессия Внукова – военный радист, он овладел ей прямо на фронте, куда попал сразу после школы. А
				затем получил инженерное образование и служил настройщиком радиолокационных систем на торговых и военных
				судах.</p>
			<p>Вторая профессия – картограф-топограф. Захотев посмотреть мир, Внуков работал в геологической разведке и
				прошёл Сибирь, Чукотку, Дальний Восток.</p>
			<p>Ну а третья профессия сделала Николая Внукова знаменитым: он стал писателем, и прежде всего - детским. Он
				писал о том, что знал и видел сам – о людях, которые попадали в опасные ситуации и находили из них выход
				благодаря твердости, стойкости, смелости. Многие его книги рассказывают о детях и подростках, которые
				«строят» по кирпичику свой характер, воспитывают в себе смекалку, целеустремленность, отвагу. Самой
				знаменитой книгой Внукова о становлении характера человека стала повесть «Один».</p>

			<h2>ОДИН</h2>
			<p>«Что самое главное для человека на земле? Знать и уметь. Знать, как делается та или иная вещь, и уметь её
				сделать. И чем больше человек знает и умеет, тем легче найти ему выход из самого трудного положения и
				тем ценнее он сам для других людей».</p>
			<p>В повести «Один» (1982 год) Николай Внуков рассказал историю мальчика Саши Бараша, который прожил
				несколько недель в полном одиночестве на необитаемом острове. Возможно, у Саши был реальный прототип, а,
				может быть, Внуков писал и о своем опыте – ему тоже довелось жить одному на острове.</p>
			<p>Книга была очень популярна в нашей стране и переведена на многие языки, а в Японии юные читатели признали
				ее лучшим произведением 1988 года, что стало поводом включить это произведение в школьную программу.
				Внукова был приглашен в Японию, где, в частности, встретился с сыном императора принцем Нарухито, и эта
				встреча была очень теплой.</p>

			<h2>ЭТО ГОРОД ЛЕНИНГРАД</h2>
			<p>Большую часть своей жизни Николай Внуков, с 1948 года, прожил в Ленинграде. Здесь он учился, работал,
				здесь почувствовал себя «ленинградским писателем». Он начал писать сразу после войны, работал в газетах,
				пробовал себя и в художественной литературе.</p>
			<p>В 1954 году Николай Внуков стал победителем конкурса газеты «Смена»: его рассказ «Двенадцать тысяч шагов»
				получил вторую премию. В 1958 году начались постоянные публикации его произведений. Но лишь через десять
				лет он решился стать профессиональным литератором в 1967 году вышла в свет его первая книга «Розовая
				Гвиана».</p>
			<p>Многие ленинградские дети читали его рассказы в журналах «Искорка» и «Костёр» - Внуков входил в редакцию
				«Костра». Много он руководил литературным объединением молодых детских писателей «Дружба» при
				издательстве «Детская литература». Он жил в Выборгском районе, на улице Новороссийской, д.22. Действие
				некоторых его книг происходит в Ленинграде, особенно в годы блокады.</p>

			<h2>КОРАБЛИ</h2>
			<p>Еще в детстве Николай Внуков влюбился в море и корабли. Он воспитывался в семье своего дяди Михаила
				Николаевича Савинова, который еще до революции служил механиком на императорской яхте «Полярная звезда».
				Именно он рассказал мальчику о далеких морских путешествиях. Он познакомил Николая с книгами Стивенсона,
				Дюма, Купера и Джека Лондона. А еще у дяди были великолепные альбомы с изображениями знаменитых
				парусников мира.</p>
			<p>К седьмому классу Коля Внуков уже назубок знал названия всех снастей, парусов и деталей корабля.
				«Наверное, в то время, когда я читал эти книги, во мне пробудилась романтика. И – низкий поклон этим
				писателям – она живёт во мне до сих пор».</p>
			<p>Многие книги Николая Внукова посвящены кораблям. О знаменитых парусниках он рассказывает в сборнике
				рассказов «Паруса над волнами». О кораблях-призраках – в повести «“Сверре” идет на помощь». Для
				иллюстрированного биографического словаря «Великие путешественники» Николай Андреевич написал биографии
				более 150 выдающихся мореплавателей и землепроходцев.</p>

			<h2>КНИЖНЫЕ ПУТЕШЕСТВИЯ</h2>
			<p>Николай Внуков обошёл и объехал почти всю нашу страну. Путешествия, далёкие и близкие, всегда манили его.
				Книжные путешествия он считал такими же интересными и важными, как «реальные», настоящие.
				Ребенок-читатель может с помощью книг Внукова побывать в самых разных местах. Широко известна повесть
				«Слушайте песню перьев!», посвященная жизни индейца Сат-Ока в ХХ веке.</p>
			<p>Читая ее, мы вместе с героем оказываемся в опасных приключениях, которые происходят в Польше, Северной
				Америке, России. В других произведениях Внуков знакомит нас с Сибирью, Дальним Востоком и, конечно,
				Кавказом, в горах которого он вырос.</p>
			<p>Выставка состоит из 8 стендов, размещенных в зале для мероприятий и интерактивной инсталляции «Рабочий
				стол Николая Внукова», где размещена его печатная машинка, на которой желающие могут печатать фрагменты
				его произведений – они также находятся на столе или рядом на стеллаже или полке. Документы Внукова
				используются как иллюстративный материал для стендов. Возле каждого стенда может быть небольшая полка с
				книгами, упомянутыми в данном стенде. Если такой возможности нет, то можно поставить все книги на один
				стеллаж.</p>
		</div>
		<div class="gallery-wrapper">
			<div class="gallery">
				<div class="row">
					<img src="territory/1.png" alt="Image 1" />
					<img src="territory/2.png" alt="Image 2" />
					<img src="territory/3.png" alt="Image 3" />
				</div>

				<div class="row">
					<img src="territory/4.png" alt="Main Image" class="wide" />
				</div>

				<div class="row">
					<img src="territory/5.png" alt="Image 5" />
					<img src="territory/6.png" alt="Image 6" />
				</div>
			</div>
		</div>
	</div>
</template>
<script></script>

<style scoped>
.wrapper {
	padding: 0 20px;
}

.text {
	max-width: 1200px;
	margin: 0 auto;
	padding: 20px 0;
}

.gallery-wrapper {
	display: flex;
	justify-content: center;
	margin-top: 20px;
}

.gallery {
	display: flex;
	flex-direction: column;
	gap: 10px;
	width: 100%;
	max-width: 1200px;
}

.row {
	display: flex;
	gap: 10px;
	justify-content: center;
}

.row:nth-child(1) img {
	width: calc(33.333% - 6.66px);
}

.row:nth-child(2) .wide {
	width: 100%;
}

.row:nth-child(3) img {
	width: calc(50% - 5px);
}

img {
	height: auto;
	display: block;
	box-shadow: 0 2px 8px rgba(0, 0, 0, 0.2);
	object-fit: cover;
}

@media(max-width: 768px) {
	.container_title {
		padding-top: 40px;
	}

	.text p {
		margin: 10px auto;
	}
}
</style>
