<template>
	<div class="photo-page">
		<div class="photo-container">
			<div class="photo-img">
				<img
					:src="photo.src"
					:alt="photo.title"
					:class="{ photo1: photo.id === 1 }"
				/>
			</div>
			<div class="photo-text">
				<h2>{{ photo.title }}</h2>
				<p>{{ photo.text }}</p>
			</div>
		</div>
	</div>
	<button class="back-button" @click="$router.back()">Назад</button>
</template>

<script>
export default {
	props: ['id'],
	data() {
		return {
			photos: [
				{
					id: 0,
					src: '/src/assets/writer/1.png',
					title: 'ЯПОНИЯ:\nпутешествие на Восток',
					text: 'Николай Андреевич родился в 1925 году в Зарайске Московской области. Вскоре семья переехала в Ленинград, где мальчику большое внимание уделял его дядя – моряк, побывавший во многих странах мира. Именно тогда из рассказов дядюшки и позднее из многочисленных приключенческих и исторических книг и возникла страстная любовь будущего писателя к морю и особенно к парусным кораблям. Спустя некоторое время семья Внуковых переехала на Кавказ, где Николай закончил школу и в 1942 году, еще до 18-летия, был призван в РККА.\n\n Николай Андреевич родился в 1925 году в Зарайске Московской области. Вскоре семья переехала в Ленинград, где мальчику большое внимание уделял его дядя – моряк, побывавший во многих странах мира. Именно тогда из рассказов дядюшки и позднее из многочисленных приключенческих и исторических книг и возникла страстная любовь будущего писателя к морю и особенно к парусным кораблям. Спустя некоторое время семья Внуковых переехала на Кавказ, где Николай закончил школу и в 1942 году, еще до 18-летия, был призван в РККА.',
				},
				{
					id: 1,
					src: '/src/assets/writer/2.png',
					title: 'Фото 2',
					text: 'Говоря о Николае Внукове, друзья и критики отмечали его удивительное свойство – смотреть на мир глазами ребёнка. Замечать то, на что взрослый человек не обратит внимания. Возможно, именно благодаря этим качествам, ленинградский писатель заслужил любовь юного читателя. Приключения Коли начались ещё в детстве.Родился мальчик 8 ноября 1925 года в городе Зарайске.В 4 года из- за неблагополучной обстановки в семье Колю отправили на воспитание к сестре отца – Елене Андреевне Савиной.До 6 лет Внуков жил в Ленинграде, а в 1932 году переехал с тетей и дядей на Северный Кавказ.Поступил в среднюю школу города Нальчика.Там и провёл всё детство. «Нашими излюбленными местами были: летом – речка Нальчик, озеро –Трек, гора Кизиловка, парк, спортивные площадки, где укреплялись бицепсы и закалялась воля; в остальное время года – помимо школы, занимавшей основную часть жизни, Дворец пионеров с его интереснейшими кружками, спортивные секции, лыжные походы, и конечно же любимый городской читальный зал с уцелевшим и поныне двухэтажным доме», — пишет в статье друг Николая Андреевича Виталий Лесев.Юный Коля любил много читать. Его увлекали приключения и научная фантастика. Любимыми писателями были Жюль Верн, Джек Лондон, Илья Ильф и Евгений Петров, Михаил Булгаков и Александр Грин. В домашней библиотеке Внукова есть целое собрание сочинений Александра Грина, которые бережно хранит дочь Николая Андреевича. Часто на уроках вместо учебников Коля читал художественную литературу. За что получал выговоры от учителей и направление в кабинет директора. Но всё заканчивалось благополучно после чистосердечного признания нарушителя. Директор школы Леонид Наильевич Кудряшов понимал, что в поступках юноши не было злого умысла, всему виной интересная книга. «Никто из нас не был так начитан, как Внуков. У его дяди была уникальная библиотека, поэтому, рано пристрастившись к чтению, он знал столько удивительного, что мы с нескрываемой завистью слушали его рассказы о книгах», — отмечает Лесев в статье. После захватывающих историй ребята бежали в библиотеку, чтобы найти книги и скорее их прочитать. Юный Внуков был примером для подражания сверстников. Коля часто посещал читальный зал, ходил на творческие встречи с артистами, писателями и поэтами. Здесь выступали известные деятели культуры: Владимир Немерович-Данченко, Василий Качалов, Ольга Книппер-Чехова, Борис Новиков и другие.Учился Николай Внуков во Второй мужской школе. Она располагалась на высоком обрыве, прямо над речкой. Летом ребята с нетерпением ждали окончания уроков, чтобы скорее искупаться в прохладной горной реке.  «Мы учились в первую смену. Первая смена — самая лучшая. Пока сидишь на уроках, вода в речке успевает хорошенько прогреться, и как только грянет звонок с последнего урока, мы наперегонки бросаемся к спуску с обрыва и мчимся на берег, усыпанный гладкой белой галькой», — писал Внуков в рассказе «Рыбий жир». Так беззаботно проходили годы. Но не успел Коля оглянуться, как детство кончилось. Это произошло летом 1942 года. В 17 лет парня призвали в армию для защиты Родины. И уже 22 сентября бывший девятиклассник принял боевое крещение в сражение под селением Эльхотово. О событиях тех страшных военных лет писатель расскажет позже в повести «Наша восемнадцатая осень». «Именно здесь, в пыльном, заброшенном классе эльхотовской школы, я понял, что дерусь не только за будущее свое и своих друзей, но и за прошлое, за Пушкина, за Тургенева, за Маяковского, за всю тысячелетнюю историю нашу, за голубое небо и за великую тишину над полями Родины...», —пишет Внуков в книге «Наша восемнадцатая осень».«Мне не исполнилось восемнадцати, когда началась Великая Отечественная война. В то время я жил в Нальчике, столице Кабардино-Балкарской республики. Время было тяжёлое, фашисты наступали на Кавказ, они совсем близко подошли к нашему тихому городу», — предисловие автора к сборнику «Четыре рассказа о войне». Спустя 43 года старые друзья Николай Внуков и Виталий Лесев встретились в Ленинграде. И, как отмечает Лесев, Николай совершенно не изменился. «Передо мной был человек, который не разучился радоваться каждой минуте, сохранил прекрасное детское чувство удивления любому незначительному событию и чудесную способность ожидания новых открытий», — писал Виталий. В своих произведениях Внуков не стремился поучать детей: он сам смотрел на мир глазами ребёнка и писал об удивительных открытиях, поджидающих нас на каждом шагу, стоит только посмотреть внимательнее.',
				},
				{
					id: 2,
					src: '/src/assets/writer/3.png',
					title: 'Фото 3',
				},
				{
					id: 3,
					src: '/src/assets/writer/4.png',
					title: 'Фото 4',
					text: 'От Эльхотово до Мукдена: боевой путь Николая Внукова Николай Андреевич был призван в армию прямо со школьной скамьи, когда ему было 17 лет. 10 августа 1942 года ушел на фронт. Был зачислен пулемётчиком в 413-й батальон 389-й стрелковой дивизии 37-й армии. Первый бой встретил 22 сентября 1942 года под селением Эльхотово (Северная Осетия). В танковом сражении из 260 человек осталось в живых всего 39. К счастью, среди них оказался и наш писатель, житель Выборгского района, Николай Внуков. В сражение у «Эльхотовских ворот» Николай Андреевич получил ранение в голову, после чего был направлен в госпиталь города Орджоникидзе (Владикавказ). Здесь же прошёл краткосрочные курсы радиоподготовки. В 1943 году участвовал в боях за освобождение Моздока в качестве радиста 4-го отдельного батальона связи. Затем были бои за Ростов на Дону, Новочеркасск, Новошахтинск, Кривой Рог и Тирасполь. Через Румынию вошли в Венгрию, а потом в Австрию. В Вене для Николая Андреевича и окончилась Великая Отечественная война. «Однако в конце июля нас снова погрузили в эшелоны и мы оказались на станции Борзя, а затем перешли границу Маньчжурии. Здесь в составе 36-й армии Забайкальского фронта мы брали Хайлар, а затем Цицикар. Эту вторую войну окончил в Мукдене», — пишет о себе Николай Внуков. За период Великой Отечественной войны Николай Андреевич был контужен и дважды ранен, дошёл до австрийской Вены и китайского Мукдэна, награжден медалями и орденами: Медаль «За победу над Германией» Медаль «За победу над Японией» Медаль «За оборону Кавказа» Медаль «За взятие Будапешта» Медаль Жукова Медаль «Ветеран труда» Орден «Отечественная войны II степени» Лишь в 1947 году он вернулся домой, закончил школу и поступил в ЛГУ на физико-математический факультет. Однако через год бросил университет и уехал в Магадан, чтобы работать в геологоразведке и путешествовать по отдаленным краям нашей Родины. «Никаких особенных подвигов во время войны не совершал, просто работал, как работали все на фронте», Н. Внуков',
				},
				{
					id: 4,
					src: '/src/assets/writer/5.png',
					title: 'Фото 5',
				},
				{
					id: 5,
					src: '/src/assets/writer/1.png',
					title: 'Фото 6',
				},
			],
		}
	},
	computed: {
		photo() {
			return this.photos.find(p => p.id === parseInt(this.id))
		},
	},
}
</script>

<style scoped>
.photo-page {
	max-width: 1920px;
	margin: 0 auto;
}
.back-button {
	padding: 10px 20px;
	margin-bottom: 20px;
	cursor: pointer;
}
.photo-container {
	text-align: center;
}
.photo-img {
	max-width: 1920px;
	height: 800px;
	margin: 0 auto;
	overflow: hidden;
	display: flex;
	justify-content: center;
	align-items: center;
}
.photo1 {
	object-position: bottom;
}
.photo-img img {
	width: 100%;
	height: 100%;
	object-fit: cover;
	object-position: top;
	display: block;
}

.photo-text {
	display: flex;
	padding: 50px;
	flex-direction: row;
	margin-top: 50px;
	justify-content: space-between;
}
h2 {
	font-size: 4em;
	text-align: left;
	white-space: pre-line;
}
p {
	font-size: 2em;
	text-align: justify;
	width: 50%;
	white-space: pre-line;
}
</style>
